read_verilog vsdbabysoc.v
read_verilog -I./include ..rvmyth.tlv
read_verilog -I./include .clk_gate.v
read_liberty -lib ./avsdpll.lib
read_liberty -lib ./avsddac.v
read_liberty -lib .-lib /home/vlsi/Desktop/swetha/sky130_scl_9T_0.1.1/sky130_scl_9T_LP/lib/sky130_ss_1.62_125_nldm.lib
synth -top vsdbabysoc
dfflibmap -liberty .-lib /home/vlsi/Desktop/swetha/sky130_scl_9T_0.1.1/sky130_scl_9T_LP/lib/sky130_ss_1.62_125_nldm.lib
opt
abc -liberty .-lib /home/vlsi/Desktop/swetha/sky130_scl_9T_0.1.1/sky130_scl_9T_LP/lib/sky130_ss_1.62_125_nldm.lib -script +strash;scorr;ifraig;retime;{D};strash;dch,-f;map,-M,1,{D}
flatten
setundef -zero
clean -purge
rename -enumerate
stat
write_verilog -noattr ../output/synth/vsdbabysoc.synth.v
